---
kind: other
id: Properties.T:Autodesk.Revit.DB.LocationCurve
source: html/c17263d3-481f-ff41-6657-55064d3a629d.htm
---
# LocationCurve Properties

Provides the ability to get and set the curve of a curve based element.